In [1]:
import numpy as np
import pandas as pd
from env import host, user, password
from pydataset import data

1. Create a function named `get_db_url`. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [15]:
def get_db_url(data_base):
    url = f'mysql+pymysql://{user}:{password}@{host}/data_base'
    return

2. Use your function to obtain a connection to the `employees` database.

3. Once you have successfully run a query:

    a. Intentionally make a typo in the database url. What kind of error message do you see?
    
    b. Intentionally make an error in your SQL query. What does the error message look like?

In [16]:
get_db_url('employees')
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

4. Read the `employees` and `titles` tables into two separate DataFrames.

In [31]:
df_employees = pd.read_sql('SELECT * FROM employees', url)
df_titles = pd.read_sql('SELECT * FROM titles', url)

In [34]:
# Creates a local copy in .csv (comma separated valuesheet) form.
df_employees.to_csv('employees.csv')
df_titles.to_csv('titles.csv')

In [36]:
df_employees = pd.read_csv('employees.csv')
df_titles = pd.read_csv('titles.csv')

        Unnamed: 0  emp_no            title   from_date     to_date
0                0   10001  Senior Engineer  1986-06-26  9999-01-01
1                1   10002            Staff  1996-08-03  9999-01-01
2                2   10003  Senior Engineer  1995-12-03  9999-01-01
3                3   10004         Engineer  1986-12-01  1995-12-01
4                4   10004  Senior Engineer  1995-12-01  9999-01-01
...            ...     ...              ...         ...         ...
443303      443303  499997         Engineer  1987-08-30  1992-08-29
443304      443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305      443305  499998     Senior Staff  1998-12-27  9999-01-01
443306      443306  499998            Staff  1993-12-27  1998-12-27
443307      443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 5 columns]

5. How many rows and columns do you have in each DataFrame? Is that what you expected?

6. Display the summary statistics for each DataFrame.


7. How many unique titles are in the `titles` DataFrame?


8. What is the oldest date in the `to_date` column?


9. What is the most recent date in the `to_date` column?